<template>
  <div class="overview">
    <div class="side">
      <div class="s-text">
        <img :src="logo" alt="官话">
        <!-- {{side}} -->
      </div>
    </div>
    <div class="info">
      <div class="title">
        {{title}}-{{cruCity['city']}}
      </div>
      <div class="infoText">
        <p>
          {{Text[0]}}
        </p>
        <p>
          {{Text[1]}}
        </p>
        <p>
          {{Text[2]}}
        </p>
      </div>
    </div>
  </div>
</template>

<script>
import bus from './Bus.js'
export default {
  name: 'OverView',
  data () {
    return {
      side: '官话',
      title: '成渝片',
      logo: require('@/assets/side1.png'),
      total: '官话可以细分成八个分区，东北官话、北京官话、冀鲁官话、胶辽官话、中原官话、兰银官话、西南官话和江淮官话，同样的，以人口占比论，西南官话最多32.6%，兰银官话使用人口最少，为2.1%。四川地区基本以西南官话为主，有部分客家话和湘方言。以成都为例的方言区入声归为阳平调，以乐山为例的方言区入声独立。',
      cruCity: {
        city: '成都市',
        point: {
          lng: 104.07274727406208,
          lat: 30.578993724029967
        },
        area: 1
      },
      areaList: [
        '成渝片', // 1
        '灌赤片岷江小片', // 2
        '灌赤片仁富小片', // 3
        '灌赤片雅棉小片' // 4
      ],
      Text: [
        '成都又名蓉城，四川省省会，位于四川盆地西部的岷江中游地段，目前管辖11个市辖区（武侯区、青羊区、成华区、温江区、青白江区、郫都区、锦江区、金牛区、龙泉驿区、新都区、双流区）、5市（都江堰市、彭州市、邛崃市、崇州市、简阳市），4县（金堂县、大邑县、蒲江县、新津县），2个单列直管区（天府新区、高新区），共259个乡镇，116个街道，总面积14312平方千米，总人口约为2119.2万。成都人杰地灵、资源丰富，历史悠久，美食众多，被誉为天府之国、世界美食之都、国家历史文化名城、中国最佳旅游城市和“十大古都”之一等。',
        '成都话主要分布于成都市中心城区及青白江、金堂等成都东部地区，分布的地域较广，使用人口多，内部具有高度一致性，属于西南官话成渝片的范围。成都话中声母共20个，韵母36个，声调4个。成都方言与普通话相比，同大于异。在成都话中，n和I是同一音位。成都话没有zh、ch、sh、r这四个舌尖后声母，在普通话中区分的舌尖前音和舌尖后音的字，在成都方言中全部读成舌尖前音。成都话中的鼻音尾韵都比普通话少，通常只有前鼻韵，没有后鼻韵。成都方言的声调个数和普通话相同，不过调值和调型有所不同，成都方言的调值为阴平45、阳平21、上声53、去声213。成都方言阴平和普通话基本一样，都是属于高平调；阳平和普通话刚好相反，是低降调；上声，去声的调型刚好和普通话颠倒。',
        ''
      ],
      infoText: [
        { // 成渝片
          city: '成都市',
          text: [
            '成都又名蓉城，四川省省会，位于四川盆地西部的岷江中游地段，目前管辖11个市辖区（武侯区、青羊区、成华区、温江区、青白江区、郫都区、锦江区、金牛区、龙泉驿区、新都区、双流区）、5市（都江堰市、彭州市、邛崃市、崇州市、简阳市），4县（金堂县、大邑县、蒲江县、新津县），2个单列直管区（天府新区、高新区），共259个乡镇，116个街道，总面积14312平方千米，总人口约为2119.2万。成都人杰地灵、资源丰富，历史悠久，美食众多，被誉为天府之国、世界美食之都、国家历史文化名城、中国最佳旅游城市和“十大古都”之一等。',
            '成都话主要分布于成都市中心城区及青白江、金堂等成都东部地区，分布的地域较广，使用人口多，内部具有高度一致性，属于西南官话成渝片的范围。成都话中声母共20个，韵母36个，声调4个。成都方言与普通话相比，同大于异。在成都话中，n和I是同一音位。成都话没有zh、ch、sh、r这四个舌尖后声母，在普通话中区分的舌尖前音和舌尖后音的字，在成都方言中全部读成舌尖前音。成都话中的鼻音尾韵都比普通话少，通常只有前鼻韵，没有后鼻韵。成都方言的声调个数和普通话相同，不过调值和调型有所不同，成都方言的调值为阴平45、阳平21、上声53、去声213。成都方言阴平和普通话基本一样，都是属于高平调；阳平和普通话刚好相反，是低降调；上声，去声的调型刚好和普通话颠倒。',
            ''
          ]
        },
        {
          city: '资阳市',
          text: [
            '资阳市位于四川盆地中部，北靠成都、德阳，南连内江、东接重庆、遂宁，西邻眉山，区内有成渝铁路、成渝高速公路、国道318、319、321等骨干交通干线，是四川省唯一一座同时连接成渝“双核”的区域性中心城市，现有雁江区、安岳县、乐至县三大辖区。资阳历史悠久，是人类文明的重要发祥地。据1951年在资阳城西九曲河一号桥蹲发掘出的人类头骨化石鉴定，为旧石器时代晚期，距今已有35000多年，被中国科学院定名为人类发展历史上的“资阳人”，九曲河被资阳人民称之为母亲河。',
            '资阳方言属于北方方言西南官话的成渝小片，保留古音较少，其远离城区的乡镇受老派湘语的影响较大。其正处在语法化进程中。',
            '资阳话中声母共20个（19个辅音声母，1个零声母），韵母35个（单元音韵母8个，复合韵母27个），声调四个（阴平44、阳平21、上声42、去声314）。在资阳方言中，全浊声母清化，中古泥母字[n]与来母[I]字合流，影母、疑母字开口呼韵母前声母变为[ŋ]，其余全为零声母，区分轻唇、重唇，尖团合流。入声韵消失，变为阴声韵，阴声韵与阳声韵多有合并。资阳话中没有入声，多中古入声字多读为阳平，中古清声母平声字读为阴平，次浊、全浊平声字读为阳平，中古全浊上声读去音，清声母、次浊声母上声字仍读为上声。'
          ]
        },
        {
          city: '遂宁市',
          text: [
            '四川遂宁市位于四川盆地中部，涪江中游，东邻重庆、广安、南充，西连成都，南接内江、资阳，北靠德阳、绵阳。管辖船山、安居两区和蓬溪、大英三县，以及国家级经济技术开发区、高新科技产业园区、河东新区三个独立核算园区，105个乡镇、18个街道办事处，另外代管县级市射洪。幅员面积5325平方公里，总人口约365万。全市以汉族为主，有回族、藏族、蒙古族、苗族等44个少数民族，少数民族人口约1.9万。',
            '遂宁话属于西南官话成渝片，具有古入声今归阳平这一语音特点。遂宁话是遂宁市的通用方言，其中船山区和安居区的方言基本一致，是遂宁方言的权威代表，大英、蓬溪的方言与遂宁话有细微差别，射洪方言与遂宁话则有较明显的差别。',
            '遂宁市方言中声母21个（包括零声母），韵母35个，声调4个（24阴平、31阳平、53上声、213去声）。古全浊声母在遂宁方言中全部清化，古蟹摄止摄合口字与来母字相拼韵母今读作[uei]。臻摄合口字在口语中读为开口，是用频率较低。遂宁方言的四个声调中，升调一个，降调两个，降升调一个，大部分入声归阳平。遂宁方言词汇丰富，生动活泼，与普通话词汇相比存在音节数量、造词方式、表达范围不对应的情况。'
          ]
        },
        {
          city: '德阳市',
          text: [
            '四川省德阳市，别称旌城，位于成都平原东北边缘，德阳市东北与绵阳市涪城区交界，东面与绵阳市三台县交界；东南与遂宁市大英县、资阳市乐至县交界；南面与成都市金堂县、青白江区、新都区交界；西面与成都市彭州市交界，是川西平原上崛起的一座新兴工业城市，包括广汉、什邡、绵竹、中江、罗江和旌阳共六个县（市区）。',
            '德阳话属于西南官话成渝片，跟成都方言相差不大，但也有独特的地方。尤其体现在变调上，德阳话双字词为“阳平+阳平”或“阳平+去声”的时候，后字常变调为中升调34。德阳最有代表的就是中江话，由于历史、地理和人文的原因，造成中江话当中，常常夹杂着一些外地人听不大懂的东西，德阳旌阳区和中江县有的地方不分h、f，部分地方把j、q、x读作z、c、s。从历史原因挖掘，清代康雍乾时代，清政府曾强令一些外省人移民四川一一即一股人所说的“湖广填四川”。移民来川的，以湖南、湖北两省的人居多，当时两湖被称为“湖广”，清廷设湖广总督统治之。此外还有从广东、广西、福建、江西、浙江等地移来的。从那时起，两湖、两广以及浙闽地区的方言，在很大程度上影响着移居地——德阳人们的语言。从外地来的这些移民，传了若干代，大多数人原来所操的语言被本地的语言（西南官话）同化，但有一些语言因素（语音、词汇等）残留了下来。也有绝少数人，虽经过了若干代，却继续保持着其祖先在原籍所用的语言。',
            ''
          ]
        },
        {
          city: '绵阳市',
          text: [
            '绵阳市位于四川盆地西北部，涪江中上游地带，东邻广元市的青川县、剑阁县和南充市的南部县、西充县；南接遂宁市的射洪县；西接德阳市的罗江县。包括涪城区、游仙区、安州区所辖的9个乡镇（街道），绵阳素有“富乐之乡、西部硅谷”美誉，是党中央、国务院批准建设的中国唯一的科技城，我国重要的国防军工和科研生产基地，拥有中国工程物理研究院、中国空气动力研究与发展中心、中国航发四川燃气涡轮研究院等国家级科研院所18家。',
            '绵阳居民主要语言操西南官话。绵阳方言的使用分布在绵阳市城区、近郊，各区县的方言在语音、词汇、语法方面稍有差异，但不影响交际。绵阳话的代表地区是涪城区。一般本地人直接称涪城为绵阳。绵阳市涪城区方言属于西南官话成渝片。境内的汉语方言大致可以分为两片：即城北片和城南片。城南片大致有35万人口，城北片大致有52万人口。',
            '绵阳方言中声母共22个（含零声母），韵母共35个，声调共4个（不含轻声），古全浊声母清化。声调平分阴阳，有阴平和阳平，比如“衣”、“宜”读音便不同。辅音韵尾少，入声消失，未做保留，没有/-k/和/-m/，只有/-n/和/-ng/两个鼻辅音韵尾。其前鼻音和后鼻音混淆 ，如“jin”和“jing”。'
          ]
        },
        {
          city: '资阳市',
          text: [
            '资阳',
            '资阳'
          ]
        },
        {
          city: '重庆市',
          text: [
            '重庆，是长江上游地区的经济、金融、科创、航运和商贸物流中心，国家物流枢纽，西部大开发重要的战略支点、“一带一路”和长江经济带重要联结点及内陆开放高地、山清水秀美丽之地；既以江城、雾都、桥都著称，又以山城扬名。截至2021年底，下辖26个区、8个县、4个自治县，总面积8.24万平方千米，常住人口3212.43万人。',
            '重庆方言属于西南官话成渝片，本片的主要特点是入声归阳平，调型相似，四呼齐全，多数方言点没有ts组声母，n和l不分，没有m韵尾等。重庆话有19个声母，重庆话在辅音方面另一大特点就是n和l不分，确切地说是重庆话中没有鼻音声母n；重庆话无翘舌和平舌之分。重庆方言只有6个单韵母，没有ing、eng 这个两个后鼻音韵母，部分汉字读音比普通话更接近中古汉语，比如见系不颚化，保留歌韵等。',
            '现代重庆话产生于清代初期“湖广填四川”的移民浪潮中，白话中保留了大量宋元之际的词汇和读音。各地来到四川等地的百姓通过交流，逐渐地形成了一种以湖广话为主的四川话。经过历史的发展，在清代和民国初期，这种四川话逐渐地受到了北方话的影响，成为了一种官话。在抗日战争和“三线”建设时期，大量的江浙移民又把自己的方言带入了重庆话，丰富了重庆方言。随着教育的普及程度大大提高，年轻一代普通话水平加强，其方言趋向普通话的现象已显现，年轻人甚至可能听不懂老一辈说的重庆方言了，方言词汇或正在消失，抑或与普通话大致相同了。'
          ]
        },
        {
          city: '南充市',
          text: [
            '南充市位于四川省东部、嘉陵江中游西岸，四周为南充县辖区。全市总面积一百一十二平方公里，人口基本上都是汉族，有少量回、彝等少数民族。南充市管辖３个区（顺庆区、高坪区、嘉陵区）、５个县（西充县、营山县、南部县、蓬安县、仪陇县），代管１个县级市（阆中市）。南北跨度165公里，东西跨度143公里。东为达州市，南连广安市，西与遂宁、绵阳接壤，北与广元、巴中毗邻。',
            '南充话是南充的大部分区县（市）使用的语言，属于西南官话的成渝片。较之成都话的偏软和重庆话的偏硬，南充话音调较为适中。南充话中一共有19个声母(包括零声母)，平翘舌不分，部分疑母开口细音字和泥母细音合流，同时泥来母也合流，有ŋ声母，来自影母和疑母洪音。韵母一共35个，曾梗摄开口舒声和深臻摄开口舒声不分，曾梗摄舒声合口细音与臻摄舒声合口细音不分，部分曾梗摄舒声一、二等唇音字读同臻摄舒声唇音。南充方言的入声调已经消失，但入声字没有根据清浊分化为不同类，全浊入、次浊入和清入同调，全派入阳平。',
            ''
          ]
        },
        {
          city: '达州市',
          text: [
            '达州市位于四川省东北部，是由原达县地区于1993年改建为达川地区，再于2000年初撤地建市的，现辖通川区、达县、开江县、大竹县、宣汉县、渠县，代管万源市，面积1.66万平方公里，人口643万达州市地处川渝鄂陕的结合部，是中国西部四大名城重庆、成都、武汉、西安交汇辐射的中心地带达州交通方便，资源富集，近年来，这里发现了储量仅次于新疆的全国第二大气田，更使达州成为举世瞩目的投资热土。',
            '达州话属于西南官话成渝小片。达州自明代为四川分巡道中下东道的驻地。因此，达州话与川西、川南、川北口音较远而与重庆（上川东）话口音较近。达州话共有19个声母，没有n声母，零声母开口呼音节以纯元音开头，齐合撮口呼音节开头带有轻微的唇舌同部位磨擦。共有36个韵母，元音e作单韵母时偏低，u作单韵母在零声母后唇齿化。声调方面，阳平调为低降调，标写为21；阴平调结尾时略为上扬，实际调值为445；去声调上升前略带平伸，实际调值为113，无入声调保留。由于在“湖广填四川”时接纳了部分从湖南迁居的移民，达州部分地方仍保留了长沙话的特征，达县安仁乡是当时湖南人移居的集中地，至今“湘音”甚浓，堪称方言岛。',
            ''
          ]
        },
        { // 灌赤片岷江小片
          city: '泸州市',
          text: [
            '泸州市位于四川盆地南缘，东邻重庆，南界滇黔，西连宜宾、自贡，北与内江接壤。泸州市现辖江阳区、龙马潭区、纳溪区、泸县、合江，纳溪、叙永、古蔺3区5县，全市幅员面积12243平方公里。南缘山高城陡，沟壑纵横；北面浅丘起伏，平坝连片。奔腾不息的长江由西向东穿境而过，沱江、永宁河、赤水河、獭溪河、龙溪河等12条河流交织成网。同时，也是国家公路枢纽城市之一，拥有四川及滇东、黔北地区最重要的水运出海通道和实现江海联运的枢纽港。',
            '泸州话是指泸州主城区（江阳区、龙马潭区、纳溪区）及周边地区所使用的方言，以泸州主城区为代表。泸州话属于西南官话四川话灌赤片岷江小片，保留入声，语速较快，属四川话入声独立区中入声读中平调、自成调一类。',
            '泸州话中有22个声母，其中包括21个辅音声母和一个零声母。非组和晓组今读音分混，见系蟹效山咸江梗摄开口二等部分字读洪音，有部分字保留了翘舌读法。泸州方言中有43个韵母，其中单元音韵母有12个，复元音韵母有18个带鼻音韵母有13个，部分韵腹也仍保留了独特的发音特点。声调方面，中古入声字今读独立成调，有入声韵，入声韵尾消失，调值多为中平调。'
          ]
        },
        {
          city: '乐山市',
          text: [
            '乐山，古称嘉州，四川省辖地级市，位于四川中部，四川盆地西南部，地势西南高东北低。乐山是四川重要的工业城市、成都经济区南部区域中心城市、重要枢纽城市、成渝城市群重要交通节点和港口城市。成昆铁路、成贵高铁贯穿全境。乐山同时也是三江汇合之处，大渡河，青衣江在乐山大佛脚下汇入岷江。截至2020年底，乐山市辖4区、6县，代管1个县级市，全市总面积12720.03平方公里。',
            '乐山方言作为西南官话灌赤片中岷江小片的代表语言，是四川方言中“南路话”的一种。乐山话分布在岷江流域以西一带，由于古代山川河流的阻挡，移民没能大规模进入乐山等地区，所以当今的乐山方音较大程度上保留了古代巴蜀语的部分特征。',
            '乐山方言的声母包括零声母在内共有19个，声母中舌尖前音z、c、s和舌尖后音zh、ch、sh不分，乐山话大多数声母跟普通话相对应，但乐山话中多数声母的发音更加粗重和浑厚。普通话的声母h和韵母u相拼，乐山话会将h读成f。乐山话韵母共有39个。在这39个韵母中，有八个入声韵，一般圆唇音开口度较大，开口呼韵母与合口呼韵母有相混的现象。乐山话的发音粗重、强劲有力，有浊声的残留，这在四川次方言中具有独特的魅力。声调方面，共有五个调类，保留了古巴蜀语中的入声特征，分为阴平、阳平、上声、去声和入声。'
          ]
        },
        {
          city: '宜宾市',
          text: [
            '宜宾位于四川盆地南部，地处金沙江、岷江交汇处，同时也是川、滇、黔三省交汇地。作为长江上游开发最早的古老城市之一，宜宾穿越了40000多年的历史时空，承载了3000多年的酿酒史、2780多年的建城史，享有“万里长江第一城”、“西南半壁古戎州”、“中国酒都”等美誉。宜宾现为地级市，共辖9个县、1个市辖区。市辖区翠屏区，人口89万，面积1123平方公里。9县分别为：宜宾县、南溪县、江安县、长宁县、高县、药连县、琪县、兴文县、屏山县。',
            '宜宾话属于西南官话灌赤片岷江小片，有人单独为这个小片取名为“岷语”，意指西南官话区无翘舌音，且保留了古入声的方言。在普通话和成渝片语音的影响下，本片区语音正在经历逐步转变，整个岷江片呈现逐渐收缩的态势。',
            '宜宾话声母包括零声母在内，共20个，泥来二母合流，已经并为一个声母，翘舌音全部合流到了平舌音中；韵母有37个，包含了单韵母、复韵母和鼻韵母三种形式，大部分韵母跟西南官话区比较一致，但是有独特的入声韵存在。宜宾话有5个声调，调值调类分别是：阴平55、阳平31、上声42、去声13和入声33。宜宾话的调值调类总体情况跟西南官话总体类似，只是入声系统除了调值表现为低平外，还配合了韵母形式的变化。宜宾话入声韵丢失了塞音韵尾，以[ɛ]、[æ]、[ɔ]三个元音为韵腹并带有一点塞音残留，少数入声字开始出现两读甚至完全舒化，入声只有一个调类，已经没有阴阳之分。'
          ]
        },
        {
          city: '眉山市',
          text: [
            '眉山是“千古第一文人”苏东坡的家乡， 位于四川盆地成都平原西南边缘，岷江中游和青衣江下游的扇形地带，成都——乐山黄金走廊中段。南瞰乐山，东临资阳，西望雅安，是成都平原通联川南、川西南、川西、云南的咽喉要地和南大门。2000年7月，经国务院批准设立眉山市，辖东坡区、仁寿、彭山、洪雅、丹棱、青神一区五县，面积7186平方千米，人口346万。',
            '眉山话在东坡区、丹棱县和彭山区一带通行，与仁寿话、青神话不同，眉山话属于汉语北方方言西南官话的一个分支——灌赤片岷江小片，属于四川话入声独立区中入声读升调一类。',
            '同四川话其他方言点相比，主要语言特点是：声母无卷舌音，韵母无一般四川话常见的[e]、[ue]、[yu]、[iai]，低元音后的舌尖鼻音韵尾 [n] 脱落而使主要元音鼻化。眉山话声调共有五个单字调：阴平55、阳平14、上声215、去声32、入声24，保留古汉语入声，但不带塞音韵尾，少数去声字也念入声。有一些特殊的词汇、语法现象，如“怎么”说“朗个”、“现在”说 “这阵”，可能是受三苏气息影响眉山话古典词语比较多，“不搭你白了”、“靸板儿鞋”等词都体现了古语的用法。'
          ]
        },
        {
          city: '眉山市',
          text: [
            '眉山话在东坡区、丹棱县和彭山区一带通行，与仁寿话、青神话不同，眉山话属于汉语北方方言西南官话的一个分支——灌赤片岷江小片，属于四川话入声独立区中入声读升调一类。',
            '广安'
          ]
        },
        { // 灌赤片仁富小片
          city: '内江市',
          text: [
            '内江市位于四川盆地中南部，幅员面积5386平方公里，现辖市中区、东兴区、资中县、隆昌县、威远县。地势自西北向东南倾斜，属浅丘地貌。沱江纵贯市区467公里，流经资中、东兴及市中区，是市内水路运输要道。东连重庆，西接成都、资阳，南扼自贡、宜宾、泸州，北通遂宁、南充，成渝铁路、内昆铁路在这里接轨，成渝高速公路、内宜高速公路在这里汇合，是川东南乃至西南各省交通的重要交汇点。因盛产蔗糖、蜜饯，素有“甜城”之称。',
            '内江话属于以内江市市中区为代表的包括东兴区在内的西南官话的一个分支——灌赤片仁富小片。内江方言声母有25个，包括零声母。与普通话相比，增加了舌根鼻音[ŋ]、唇齿浊擦音[v]以及舌尖前浊擦音[z]等，没有舌尖中鼻音[n]，与洪音相拼时，均读作舌尖中边音[l]。既有舌尖前音[ts、tsʰ、s]，又有舌尖后音[tʂ、tʂʰ、ʂ]。内江方言韵母有37个，与普通话相比多了[e]、[io]、 [ue]、[iai]四个韵母，少了[ɣ]、[uo]、[əŋ] 、[iŋ]、[uəŋ]五个韵母。内江方言的声调调类分为阴平、阳平、上声、去声四类。和古调类的对应关系为古平声中的清声母字，今内江方言中读作阴平;古平声中的浊声母字（包括全浊和次浊），今内江方言中读作阳平:古上声中的清声母和次浊声母字，今内江方言中读作上声；古全浊上声字和古去声字（包括全清、次清、全浊和次浊），今内江方言中读为去声。',
            ''
          ]
        },
        { // 灌赤片雅棉小片
          city: '雅安市',
          text: [
            '雅安市位于川藏、川滇公路交会处，距成都120公里，是四川盆地与青藏高原的结合过渡地带、汉文化与民族文化结合过渡地带、现代中心城市与原始自然生态区的结合过渡地带，是古南方丝绸之路的门户和必经之路，曾为西康省省会。它是四川省历史文化名城和新兴的旅游城，有“雨城”之称。东邻成都、西连甘孜、南界凉山、北接阿坝，素有“川西咽喉”、“西藏门户”、“民族走廊”之称。面积15314平方千米，人口153万，共7县1区：雨城区和芦山县、名山县、天全县、荥经县、宝兴县、汉源县、石棉县7县。',
            '雅安话属于西南官话灌赤片雅棉小片。雅安话共有20个声母（包括零声母）。与普通话声母相比，雅安话声母中缺少了舌尖后音[t、th]，增加了唇齿浊擦音[v]和舌根鼻音[ŋ]。同时，平翘舌不分，唇齿音[f]和舌根音[x]不完全区分，泥娘来母字今音一律读作边音[l]。雅安话中有韵母36个，其中8个单元音，15个复元音，13个带鼻音韵母。没有舌尖后元音[ʅ]以及后鼻音[iŋ]、[əŋ]，没有[uo]、[ɣ]韵母。声调方面，在雅安话中，阴平调值是55，阳平是21，上声是42，去声是14，入声归入阴平。',
            ''
          ]
        }
      ]
    }
  },
  mounted () {
    setTimeout(() => {
      bus.$on('City', (value) => {
        this.cruCity = value
        console.log('bus接收城市' + this.cruCity)
        this.title = this.areaList[this.cruCity['area'] - 1]
        for (var i = 0; i < this.infoText.length; i++) {
          if (this.infoText[i]['city'] === this.cruCity['city']) {
            this.Text = this.infoText[i]['text']
            break
          }
        }
      })// 组件通信-接受
    }, 200)
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
.overview {
  width: 41%;
  min-height: 640px;
  /* background-color: blue; */
  display: block;
  position: relative;
  float: left;
}

.side,
.info {
  display: block;
  float: left;
}

.s-text {
  position: absolute;
  top: 30%;
  width: 100%;
  min-height: 40%;
  text-align: center;
  /* background-color: purple; */
}

.side {
  /* background-color: green; */
  height: 100%;
  width: 20%;
  position: absolute;
  left: 0%;
}

.title {
  background-color: #9E3537;
  padding: 20px;
  color: white;
}

.info {
  height: 100%;
  width: 80%;
  overflow: hidden;
  position: absolute;
  left: 20%;
}

.infoText {
  /* background-color: #2E3535; */
  height: 100%;
}

.infoText p {
  text-indent: 2em;
  text-align:justify;
}
</style>
